# Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1,5,2,9],[34,76,12,97],[23,76,34,86],[23,76,54,11],[126,25,64,92],[53,876,123,543],[54,321,987,345]])
df1

     0    1    2    3
0    1    5    2    9
1   34   76   12   97
2   23   76   34   86
3   23   76   54   11
4  126   25   64   92
5   53  876  123  543
6   54  321  987  345

In [5]:
df1.head(3)

    0   1   2   3
0   1   5   2   9
1  34  76  12  97
2  23  76  34  86

In [6]:
df1.tail(4)

     0    1    2    3
3   23   76   54   11
4  126   25   64   92
5   53  876  123  543
6   54  321  987  345

In [7]:
df1.shape

(7, 4)

In [8]:
df1.iloc[1:3,1:4]

    1   2   3
1  76  12  97
2  76  34  86

## Building DataFrames with Pandas

### From Python Dictionaries

In [9]:
list1 = ['S1','S2','S3','S4','S5']
Maths = [98,87,98,78,82]
Physics = [78,89,100,97,89]
Chemistry = [56,76,87,76,98]
title = ['ID','Maths','Physics','Chemistry']
values = [list1, Maths, Physics, Chemistry]
result = list(zip(title,values))
print(result)

[('ID', ['S1', 'S2', 'S3', 'S4', 'S5']), ('Maths', [98, 87, 98, 78, 82]), ('Physics', [78, 89, 100, 97, 89]), ('Chemistry', [56, 76, 87, 76, 98])]

In [10]:
result1 = dict(result)
df2 = pd.DataFrame(result1)
df2

   ID  Maths  Physics  Chemistry
0  S1     98       78         56
1  S2     87       89         76
2  S3     98      100         87
3  S4     78       97         76
4  S5     82       89         98

## Importing data

### DataFrames from CSV files

In [11]:
df3 = pd.read_csv('F:\\Programming\\Git_Materials\\DataHouse\\data.csv')
df3

,INSTRUMENT,SYMBOL,OPEN_PRICE,HI_PRICE,LO_PRICE,CLOSE_PRICE,OPEN_INT,TRD_VAL,TRD_QTY,NO_OF_CONT,NO_OF_TRADE
0,FUTIDX,BANKNIFTY,29375.50,29608.00,28820.00,28912.05,1751025,2.410000e+11,8233350,329334,231443
1,FUTIDX,BANKNIFTY,29410.05,29635.90,28849.95,28944.65,263975,1.333577e+10,455425,18217,13694
2,FUTIDX,BANKNIFTY,29879.95,29879.95,28864.20,28951.75,38925,1.510821e+09,51650,2066,1404
3,FUTIDX,NIFTY,12857.70,12976.25,12753.00,12793.50,11622900,1.690000e+11,13082775,174437,120635
4,FUTIDX,NIFTY,12897.45,12989.70,12777.35,12811.60,2042025,1.542744e+10,1196025,15947,12190
...,...,...,...,...,...,...,...,...,...,...,...
390,FUTSTK,WIPRO,344.10,348.15,341.35,342.00,6352000,1.998892e+09,5811200,1816,1290
391,FUTSTK,WIPRO,345.50,347.25,343.00,343.00,115200,3.645296e+07,105600,33,33
392,FUTSTK,ZEEL,189.30,192.50,185.65,186.95,32193000,2.278077e+09,12021000,4007,3719
393,FUTSTK,ZEEL,189.85,193.00,186.40,187.55,2694000,6.321768e+08,3321000,1107,962
394,FUTSTK,ZEEL,192.20,193.00,187.50,187.65,96000,8.546400e+06,45000,15,15

In [12]:
print(df3['OPEN_INT'].dtype)

int64

In [13]:
df3['OPEN_INT'].dtype

dtype('int64')

## Saving processed DataFrames

### To CSV files

In [14]:
df4 = pd.DataFrame([[2,65,3,78],[23,76,8,2],[23,87,56,44],[23,76,87,45],[2,7,9,43]],columns=['A1','B1','C1','D1'])
# exporting csv file to the desired file location after making it from the DataFrame
# df4.to_csv('F:\\Programming\\Git_Materials\\DataHouse\\export.csv', index=False)
df4.to_csv('F:\\Programming\\Git_Materials\\DataHouse\\export.csv')

## Pandas - Operations

### Creating index for entities

In [15]:
df5 = pd.read_csv('F:\\Programming\\Git_Materials\\DataHouse\\district_covid_cases.csv')
# setting 'dname' as the index
df5.set_index('dname', inplace=True)
df5.head(5)

,sname,confirmed,dead,recovered,active
dname,,,,,
NICOBARS,ANDAMAN AND NICOBAR ISLANDS,0,0,0,0
NORTH AND MIDDLE ANDAMAN,ANDAMAN AND NICOBAR ISLANDS,1,0,1,0
SOUTH ANDAMAN,ANDAMAN AND NICOBAR ISLANDS,51,0,32,19
UNKNOWN,ANDAMAN AND NICOBAR ISLANDS,4368,60,4161,147
ANANTAPUR,ANDHRA PRADESH,65408,571,63715,1122

### Type and information about DataFrame

In [16]:
print("Type:\n",type(df5))
print("Information about the dataframe:",df5.info)

Type:
 <class 'pandas.core.frame.DataFrame'>
Information about the dataframe: <bound method DataFrame.info of                                                 sname  confirmed  dead  \
dname
NICOBARS                  ANDAMAN AND NICOBAR ISLANDS          0     0
NORTH AND MIDDLE ANDAMAN  ANDAMAN AND NICOBAR ISLANDS          1     0
SOUTH ANDAMAN             ANDAMAN AND NICOBAR ISLANDS         51     0
UNKNOWN                   ANDAMAN AND NICOBAR ISLANDS       4368    60
ANANTAPUR                              ANDHRA PRADESH      65408   571
...                                               ...        ...   ...
NORTH 24 PARGANAS                         WEST BENGAL      81377  1657
PASCHIM BARDHAMAN                         WEST BENGAL      10959   106
PASCHIM MEDINIPUR                         WEST BENGAL      15266   221
PURBA MEDINIPUR                           WEST BENGAL      15685   203
SOUTH 24 PARGANAS                         WEST BENGAL      26258   488

                          recovered  active
dname
NICOBARS                          0       0
NORTH AND MIDDLE ANDAMAN          1       0
SOUTH ANDAMAN                    32      19
UNKNOWN                        4161     147
ANANTAPUR                     63715    1122
...                             ...     ...
NORTH 24 PARGANAS             72871    6849
PASCHIM BARDHAMAN              9738    1115
PASCHIM MEDINIPUR             13325    1720
PURBA MEDINIPUR               14015    1467
SOUTH 24 PARGANAS             23296    2474

[286 rows x 5 columns]>

### Shape of a DataFrame

In [17]:
print("Shape of datafframe:",df5.shape)
# df5.drop_duplicates()
# print(df5.shape)

Shape of datafframe: (286, 5)

### Some operations on DataFrames...

In [18]:
# columns of DataFrames
print("Columns of dataframe:\t",df5.columns)

Columns of dataframe:	 Index(['sname', 'confirmed', 'dead', 'recovered', 'active'], dtype='object')

In [19]:
# rename the attributes of the dataframe
df5.rename(columns={'sname':'state_name'},inplace=True)
print("Columns of dataframe:\t",df5.columns)

Columns of dataframe:	 Index(['state_name', 'confirmed', 'dead', 'recovered', 'active'], dtype='object')

### Merging two DataFrames

In [20]:
df6 = pd.DataFrame([[2,6,8],[63,87,91],[4,8,1]], columns=['A','B','C'])
df6

    A   B   C
0   2   6   8
1  63  87  91
2   4   8   1

In [21]:
df7 = pd.DataFrame([[4,6,1],[63,86,91],[7,8,3]], columns=['X','Y','Z'])
df7

    X   Y   Z
0   4   6   1
1  63  86  91
2   7   8   3

In [22]:
df8 = pd.merge(df6, df7, left_on='B', right_on='Y')
df8

   A  B  C  X  Y  Z
0  2  6  8  4  6  1
1  4  8  1  7  8  3

### Describe a DataFrame

In [24]:
print(df5.describe())

           confirmed          dead      recovered        active
count     286.000000    286.000000     286.000000    286.000000
mean    20078.244755    305.688811   17720.297203   2047.458042
std     40474.420003    912.509413   37461.240339   5528.414341
min         0.000000      0.000000       0.000000   -527.000000
25%      2811.500000     15.250000    1516.250000    151.250000
50%      7485.500000     69.500000    6297.000000    485.500000
75%     20603.250000    237.250000   18395.000000   1539.500000
max    346702.000000  10422.000000  325322.000000  70648.000000

### count(), nunique(), and unique() functions

In [28]:
print("The number of state entries in district_covid_cases: ",df5['state_name'].count())
print("The number of unique state entries in district_covid_cases: ",df5['state_name'].nunique())
print("The unique state_name entries in district_covid_cases: ",df5['state_name'].unique())

The number of state entries in district_covid_cases:  286
The number of unique state entries in district_covid_cases:  35
The unique state_name entries in district_covid_cases:  ['ANDAMAN AND NICOBAR ISLANDS' 'ANDHRA PRADESH' 'ARUNACHAL PRADESH'
 'ASSAM' 'BIHAR' 'CHANDIGARH' 'CHATTISHGARH'
 'DADRA AND NAGAR HAVELI AND DAMAN AND DIU' 'DELHI' 'GOA' 'GUJARAT'
 'HARYANA' 'HIMACHAL PRADESH' 'JAMMU AND KASHMIR' 'JHARKHAND' 'KARNATAKA'
 'KERALA' 'LADAKH' 'MADHYA PRADESH' 'MAHARASHTRA' 'MANIPUR' 'MEGHALAYA'
 'MIZORAM' 'NAGALAND' 'ODISHA' 'PUDUCHERRY' 'PUNJAB' 'RAJASTHAN' 'SIKKIM'
 'TAMIL NADU' 'TELANGANA' 'TRIPURA' 'UTTAR PRADESH' 'UTTARAKHAND'
 'WEST BENGAL']

## Accessing using Index - .iloc

#### Argument can be,

* integer -> 3
* list of integers -> [3,5,7,8]
* slice objects -> 0:9

Eg:

* data-frame**.iloc[4]**                    -> Gets row 4
* data-frame**.iloc[[2,3,4,5], [2,4]]**     -> Gets rows 2,3,4,5 with columns 2 and 4
* data-frame**.iloc[:5, 1:3]**              -> Gets rows 0 to 4 with columns 1 to 2

*Note - if slice is a:b, then a is included, b is excluded*

In [30]:
# basically, .iloc[] is the slicing standard equivalent of the pandas dataframe display technique
print(df5.iloc[3:8,0])

dname
UNKNOWN          ANDAMAN AND NICOBAR ISLANDS
ANANTAPUR                     ANDHRA PRADESH
CHITTOOR                      ANDHRA PRADESH
EAST GODAVARI                 ANDHRA PRADESH
GUNTUR                        ANDHRA PRADESH
Name: state_name, dtype: object

## Accessing using location - .loc[ ]

In [40]:
df6 = pd.read_csv('F:\\Programming\\Git_Materials\\DataHouse\\got-character-deaths.csv')
df6.set_index('Name',inplace=True)
print(df6.head())
print("\n\nUsing loc method:\t",df6.loc['Adrack Humble','Death Year'])

                             Allegiances  Death Year  Book of Death  \
Name
Addam Marbrand                 Lannister         NaN            NaN
Aegon Frey (Jinglebell)             None       299.0            3.0
Aegon Targaryen          House Targaryen         NaN            NaN
Adrack Humble              House Greyjoy       300.0            5.0
Aemon Costayne                 Lannister         NaN            NaN

                         Death Chapter  Book Intro Chapter  Gender  Nobility  \
Name
Addam Marbrand                     NaN                56.0       1         1
Aegon Frey (Jinglebell)           51.0                49.0       1         1
Aegon Targaryen                    NaN                 5.0       1         1
Adrack Humble                     20.0                20.0       1         1
Aemon Costayne                     NaN                 NaN       1         1

                         GoT  CoK  SoS  FfC  DwD
Name
Addam Marbrand             1    1    1    1    0
Aegon Frey (Jinglebell)    0    0    1    0    0
Aegon Targaryen            0    0    0    0    1
Adrack Humble              0    0    0    0    1
Aemon Costayne             0    0    1    0    0


Using loc method:	 300.0

## Creating subsets using relational operators

In [43]:
# get a general idea about the data we have and are going to use
df5.iloc[10:20,:]

                       state_name  confirmed  dead  recovered  active
dname
S.P.S. NELLORE     ANDHRA PRADESH      60123   487      59244     392
VISAKHAPATNAM      ANDHRA PRADESH      56532   514      54305    1713
WEST GODAVARI      ANDHRA PRADESH      87936   504      85137    2295
Y.S.R. KADAPA      ANDHRA PRADESH      52899   441      51332    1126
CHANGLANG       ARUNACHAL PRADESH       1162     3       1134      25
PAPUM PARE      ARUNACHAL PRADESH       6390    21       5424     945
CACHAR                      ASSAM       6216    35       1498    4683
DIBRUGARH                   ASSAM       9486    90       2409    6987
GOLAGHAT                    ASSAM       3803    43       1656    2104
JORHAT                      ASSAM       8771    48       1752    6971

In [46]:
df7 = df5['dead']<1000
# below one-liner code gives boolean value for the sought-after attribute for all the rows
# print(df7)
# some sort of masking stuff happening here...
df8 = df5[df7]
print(df8)

                                           state_name  confirmed  dead  \
dname
NICOBARS                  ANDAMAN AND NICOBAR ISLANDS          0     0
NORTH AND MIDDLE ANDAMAN  ANDAMAN AND NICOBAR ISLANDS          1     0
SOUTH ANDAMAN             ANDAMAN AND NICOBAR ISLANDS         51     0
UNKNOWN                   ANDAMAN AND NICOBAR ISLANDS       4368    60
ANANTAPUR                              ANDHRA PRADESH      65408   571
...                                               ...        ...   ...
NADIA                                     WEST BENGAL      13352   168
PASCHIM BARDHAMAN                         WEST BENGAL      10959   106
PASCHIM MEDINIPUR                         WEST BENGAL      15266   221
PURBA MEDINIPUR                           WEST BENGAL      15685   203
SOUTH 24 PARGANAS                         WEST BENGAL      26258   488

                          recovered  active
dname
NICOBARS                          0       0
NORTH AND MIDDLE ANDAMAN          1       0
SOUTH ANDAMAN                    32      19
UNKNOWN                        4161     147
ANANTAPUR                     63715    1122
...                             ...     ...
NADIA                         11397    1787
PASCHIM BARDHAMAN              9738    1115
PASCHIM MEDINIPUR             13325    1720
PURBA MEDINIPUR               14015    1467
SOUTH 24 PARGANAS             23296    2474

[272 rows x 5 columns]

### Using groupby

In [48]:
# first, groups the states and then displays the count of all the other attributes state-wise distinctly
print(df5.groupby('state_name').count())

                                          confirmed  dead  recovered  active
state_name
ANDAMAN AND NICOBAR ISLANDS                       4     4          4       4
ANDHRA PRADESH                                   10    10         10      10
ARUNACHAL PRADESH                                 2     2          2       2
ASSAM                                            10    10         10      10
BIHAR                                            10    10         10      10
CHANDIGARH                                        1     1          1       1
CHATTISHGARH                                     10    10         10      10
DADRA AND NAGAR HAVELI AND DAMAN AND DIU          4     4          4       4
DELHI                                            11    11         11      11
GOA                                               2     2          2       2
GUJARAT                                          10    10         10      10
HARYANA                                          10    10         10      10
HIMACHAL PRADESH                                 10    10         10      10
JAMMU AND KASHMIR                                10    10         10      10
JHARKHAND                                        10    10         10      10
KARNATAKA                                        10    10         10      10
KERALA                                           10    10         10      10
LADAKH                                            2     2          2       2
MADHYA PRADESH                                   10    10         10      10
MAHARASHTRA                                      10    10         10      10
MANIPUR                                          10    10         10      10
MEGHALAYA                                        11    11         11      11
MIZORAM                                           2     2          2       2
NAGALAND                                         10    10         10      10
ODISHA                                           10    10         10      10
PUDUCHERRY                                        4     4          4       4
PUNJAB                                           10    10         10      10
RAJASTHAN                                        10    10         10      10
SIKKIM                                            5     5          5       5
TAMIL NADU                                       10    10         10      10
TELANGANA                                        10    10         10      10
TRIPURA                                           8     8          8       8
UTTAR PRADESH                                    10    10         10      10
UTTARAKHAND                                      10    10         10      10
WEST BENGAL                                      10    10         10      10